program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.30.0"}, {"coremlc-version", "1839.0.0"}})]
{
    func main<ios16>(tensor<fp32, [1, 77]> input_ids) {
            tensor<int32, []> var_5 = const()[name = tensor<string, []>("op_5"), val = tensor<int32, []>(-1)];
            tensor<bool, []> var_6 = const()[name = tensor<string, []>("op_6"), val = tensor<bool, []>(false)];
            tensor<string, []> cast_1_dtype_0 = const()[name = tensor<string, []>("cast_1_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, []> inputs_embeds_axis_0 = const()[name = tensor<string, []>("inputs_embeds_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> inputs_embeds_batch_dims_0 = const()[name = tensor<string, []>("inputs_embeds_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [49408, 768]> text_encoder_text_model_embeddings_token_embedding_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_embeddings_token_embedding_weight_to_fp16"), val = tensor<fp16, [49408, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<int32, [1, 77]> cast_2 = cast(dtype = cast_1_dtype_0, x = input_ids)[name = tensor<string, []>("cast_2")];
            tensor<fp16, [1, 77, 768]> inputs_embeds_cast = gather(axis = inputs_embeds_axis_0, batch_dims = inputs_embeds_batch_dims_0, indices = cast_2, x = text_encoder_text_model_embeddings_token_embedding_weight_to_fp16)[name = tensor<string, []>("inputs_embeds_cast")];
            tensor<fp16, [1, 77, 768]> position_embeddings_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [44352]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(75890816))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(75935232))), name = tensor<string, []>("position_embeddings_to_fp16_palettized"), shape = tensor<uint32, [3]>([1, 77, 768])];
            tensor<fp16, [1, 77, 768]> input_3_cast = add(x = inputs_embeds_cast, y = position_embeddings_to_fp16_palettized)[name = tensor<string, []>("input_3_cast")];
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = tensor<string, []>("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(75935424)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(75937024)))];
            tensor<fp16, []> var_12_to_fp16 = const()[name = tensor<string, []>("op_12_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 77, 768]> hidden_states_1_cast = layer_norm(axes = hidden_states_1_axes_0, beta = text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16, x = input_3_cast)[name = tensor<string, []>("hidden_states_1_cast")];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(75938624))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76381056))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76381248)))];
            tensor<fp16, [1, 77, 768]> var_86_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16_palettized, x = hidden_states_1_cast)[name = tensor<string, []>("op_86_cast")];
            tensor<fp16, []> var_87_to_fp16 = const()[name = tensor<string, []>("op_87_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 768]> tensor_5_cast = mul(x = var_86_cast, y = var_87_to_fp16)[name = tensor<string, []>("tensor_5_cast")];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76382848))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76825280))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76825472)))];
            tensor<fp16, [1, 77, 768]> tensor_1_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16_palettized, x = hidden_states_1_cast)[name = tensor<string, []>("tensor_1_cast")];
            tensor<int32, [4]> var_92 = const()[name = tensor<string, []>("op_92"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_93_cast = reshape(shape = var_92, x = tensor_1_cast)[name = tensor<string, []>("op_93_cast")];
            tensor<int32, [4]> var_94_perm_0 = const()[name = tensor<string, []>("op_94_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76827072))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77269504))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77269696)))];
            tensor<fp16, [1, 77, 768]> tensor_3_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16_palettized, x = hidden_states_1_cast)[name = tensor<string, []>("tensor_3_cast")];
            tensor<int32, [4]> var_99 = const()[name = tensor<string, []>("op_99"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_100_cast = reshape(shape = var_99, x = tensor_3_cast)[name = tensor<string, []>("op_100_cast")];
            tensor<int32, [4]> var_101_perm_0 = const()[name = tensor<string, []>("op_101_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_108 = const()[name = tensor<string, []>("op_108"), val = tensor<int32, [4]>([1, 77, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_109_cast = reshape(shape = var_108, x = tensor_5_cast)[name = tensor<string, []>("op_109_cast")];
            tensor<int32, [4]> var_110_perm_0 = const()[name = tensor<string, []>("op_110_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_112 = const()[name = tensor<string, []>("op_112"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_59 = transpose(perm = var_110_perm_0, x = var_109_cast)[name = tensor<string, []>("transpose_59")];
            tensor<fp16, [12, 77, 64]> query_states_1_cast = reshape(shape = var_112, x = transpose_59)[name = tensor<string, []>("query_states_1_cast")];
            tensor<int32, [3]> var_114 = const()[name = tensor<string, []>("op_114"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_58 = transpose(perm = var_94_perm_0, x = var_93_cast)[name = tensor<string, []>("transpose_58")];
            tensor<fp16, [12, 77, 64]> key_states_3_cast = reshape(shape = var_114, x = transpose_58)[name = tensor<string, []>("key_states_3_cast")];
            tensor<int32, [3]> var_116 = const()[name = tensor<string, []>("op_116"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_57 = transpose(perm = var_101_perm_0, x = var_100_cast)[name = tensor<string, []>("transpose_57")];
            tensor<fp16, [12, 77, 64]> value_states_3_cast = reshape(shape = var_116, x = transpose_57)[name = tensor<string, []>("value_states_3_cast")];
            tensor<int32, [3]> var_119_perm_0 = const()[name = tensor<string, []>("op_119_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_1_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_1_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 64, 77]> transpose_56 = transpose(perm = var_119_perm_0, x = key_states_3_cast)[name = tensor<string, []>("transpose_56")];
            tensor<fp16, [12, 77, 77]> attn_weights_1_cast = matmul(transpose_x = attn_weights_1_transpose_x_0, transpose_y = attn_weights_1_transpose_y_0, x = query_states_1_cast, y = transpose_56)[name = tensor<string, []>("attn_weights_1_cast")];
            tensor<int32, [4]> var_121 = const()[name = tensor<string, []>("op_121"), val = tensor<int32, [4]>([1, 12, 77, 77])];
            tensor<fp16, [1, 12, 77, 77]> var_122_cast = reshape(shape = var_121, x = attn_weights_1_cast)[name = tensor<string, []>("op_122_cast")];
            tensor<fp16, [1, 1, 77, 77]> causal_attention_mask_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [4447]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77271296))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77275840))), name = tensor<string, []>("causal_attention_mask_to_fp16_palettized"), shape = tensor<uint32, [4]>([1, 1, 77, 77])];
            tensor<fp16, [1, 12, 77, 77]> attn_weights_3_cast = add(x = var_122_cast, y = causal_attention_mask_to_fp16_palettized)[name = tensor<string, []>("attn_weights_3_cast")];
            tensor<int32, [3]> var_127 = const()[name = tensor<string, []>("op_127"), val = tensor<int32, [3]>([12, 77, 77])];
            tensor<fp16, [12, 77, 77]> input_5_cast = reshape(shape = var_127, x = attn_weights_3_cast)[name = tensor<string, []>("input_5_cast")];
            tensor<fp16, [12, 77, 77]> input_7_cast = softmax(axis = var_5, x = input_5_cast)[name = tensor<string, []>("input_7_cast")];
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 77, 64]> attn_output_1_cast = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = input_7_cast, y = value_states_3_cast)[name = tensor<string, []>("attn_output_1_cast")];
            tensor<int32, [4]> var_132 = const()[name = tensor<string, []>("op_132"), val = tensor<int32, [4]>([1, 12, 77, 64])];
            tensor<fp16, [1, 12, 77, 64]> attn_output_3_cast = reshape(shape = var_132, x = attn_output_1_cast)[name = tensor<string, []>("attn_output_3_cast")];
            tensor<int32, [4]> attn_output_5_perm_0 = const()[name = tensor<string, []>("attn_output_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_135 = const()[name = tensor<string, []>("op_135"), val = tensor<int32, [3]>([1, 77, 768])];
            tensor<fp16, [1, 77, 12, 64]> transpose_55 = transpose(perm = attn_output_5_perm_0, x = attn_output_3_cast)[name = tensor<string, []>("transpose_55")];
            tensor<fp16, [1, 77, 768]> input_9_cast = reshape(shape = var_135, x = transpose_55)[name = tensor<string, []>("input_9_cast")];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77276032))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77718464))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77718656)))];
            tensor<fp16, [1, 77, 768]> hidden_states_3_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16_palettized, x = input_9_cast)[name = tensor<string, []>("hidden_states_3_cast")];
            tensor<fp16, [1, 77, 768]> input_11_cast = add(x = input_3_cast, y = hidden_states_3_cast)[name = tensor<string, []>("input_11_cast")];
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77720256)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77721856)))];
            tensor<fp16, [1, 77, 768]> input_13_cast = layer_norm(axes = input_13_axes_0, beta = text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16, x = input_11_cast)[name = tensor<string, []>("input_13_cast")];
            tensor<fp16, [3072, 768]> text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [1769472]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77723456))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79492992))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([3072, 768])];
            tensor<fp16, [3072]> text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [2304]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79493184))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79495552))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16_palettized"), shape = tensor<uint32, [1]>([3072])];
            tensor<fp16, [1, 77, 3072]> input_15_cast = linear(bias = text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16_palettized, weight = text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16_palettized, x = input_13_cast)[name = tensor<string, []>("input_15_cast")];
            tensor<fp16, []> var_150_to_fp16 = const()[name = tensor<string, []>("op_150_to_fp16"), val = tensor<fp16, []>(0x1.b3cp+0)];
            tensor<fp16, [1, 77, 3072]> var_151_cast = mul(x = input_15_cast, y = var_150_to_fp16)[name = tensor<string, []>("op_151_cast")];
            tensor<fp16, [1, 77, 3072]> var_152_cast = sigmoid(x = var_151_cast)[name = tensor<string, []>("op_152_cast")];
            tensor<fp16, [1, 77, 3072]> input_17_cast = mul(x = input_15_cast, y = var_152_cast)[name = tensor<string, []>("input_17_cast")];
            tensor<fp16, [768, 3072]> text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [1769472]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79495744))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(81265280))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 3072])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(81265472)))];
            tensor<fp16, [1, 77, 768]> hidden_states_5_cast = linear(bias = text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16_palettized, x = input_17_cast)[name = tensor<string, []>("hidden_states_5_cast")];
            tensor<fp16, [1, 77, 768]> input_19_cast = add(x = input_11_cast, y = hidden_states_5_cast)[name = tensor<string, []>("input_19_cast")];
            tensor<int32, [1]> hidden_states_7_axes_0 = const()[name = tensor<string, []>("hidden_states_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(81267072)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(81268672)))];
            tensor<fp16, [1, 77, 768]> hidden_states_7_cast = layer_norm(axes = hidden_states_7_axes_0, beta = text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16, x = input_19_cast)[name = tensor<string, []>("hidden_states_7_cast")];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(81270272))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(81712704))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(81712896)))];
            tensor<fp16, [1, 77, 768]> var_176_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16_palettized, x = hidden_states_7_cast)[name = tensor<string, []>("op_176_cast")];
            tensor<fp16, []> var_177_to_fp16 = const()[name = tensor<string, []>("op_177_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 768]> tensor_11_cast = mul(x = var_176_cast, y = var_177_to_fp16)[name = tensor<string, []>("tensor_11_cast")];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(81714496))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(82156928))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(82157120)))];
            tensor<fp16, [1, 77, 768]> tensor_7_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16_palettized, x = hidden_states_7_cast)[name = tensor<string, []>("tensor_7_cast")];
            tensor<int32, [4]> var_182 = const()[name = tensor<string, []>("op_182"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_183_cast = reshape(shape = var_182, x = tensor_7_cast)[name = tensor<string, []>("op_183_cast")];
            tensor<int32, [4]> var_184_perm_0 = const()[name = tensor<string, []>("op_184_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(82158720))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(82601152))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(82601344)))];
            tensor<fp16, [1, 77, 768]> tensor_9_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16_palettized, x = hidden_states_7_cast)[name = tensor<string, []>("tensor_9_cast")];
            tensor<int32, [4]> var_189 = const()[name = tensor<string, []>("op_189"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_190_cast = reshape(shape = var_189, x = tensor_9_cast)[name = tensor<string, []>("op_190_cast")];
            tensor<int32, [4]> var_191_perm_0 = const()[name = tensor<string, []>("op_191_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_198 = const()[name = tensor<string, []>("op_198"), val = tensor<int32, [4]>([1, 77, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_199_cast = reshape(shape = var_198, x = tensor_11_cast)[name = tensor<string, []>("op_199_cast")];
            tensor<int32, [4]> var_200_perm_0 = const()[name = tensor<string, []>("op_200_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_202 = const()[name = tensor<string, []>("op_202"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_54 = transpose(perm = var_200_perm_0, x = var_199_cast)[name = tensor<string, []>("transpose_54")];
            tensor<fp16, [12, 77, 64]> query_states_3_cast = reshape(shape = var_202, x = transpose_54)[name = tensor<string, []>("query_states_3_cast")];
            tensor<int32, [3]> var_204 = const()[name = tensor<string, []>("op_204"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_53 = transpose(perm = var_184_perm_0, x = var_183_cast)[name = tensor<string, []>("transpose_53")];
            tensor<fp16, [12, 77, 64]> key_states_7_cast = reshape(shape = var_204, x = transpose_53)[name = tensor<string, []>("key_states_7_cast")];
            tensor<int32, [3]> var_206 = const()[name = tensor<string, []>("op_206"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_52 = transpose(perm = var_191_perm_0, x = var_190_cast)[name = tensor<string, []>("transpose_52")];
            tensor<fp16, [12, 77, 64]> value_states_7_cast = reshape(shape = var_206, x = transpose_52)[name = tensor<string, []>("value_states_7_cast")];
            tensor<int32, [3]> var_209_perm_0 = const()[name = tensor<string, []>("op_209_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_7_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_7_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 64, 77]> transpose_51 = transpose(perm = var_209_perm_0, x = key_states_7_cast)[name = tensor<string, []>("transpose_51")];
            tensor<fp16, [12, 77, 77]> attn_weights_7_cast = matmul(transpose_x = attn_weights_7_transpose_x_0, transpose_y = attn_weights_7_transpose_y_0, x = query_states_3_cast, y = transpose_51)[name = tensor<string, []>("attn_weights_7_cast")];
            tensor<int32, [4]> var_211 = const()[name = tensor<string, []>("op_211"), val = tensor<int32, [4]>([1, 12, 77, 77])];
            tensor<fp16, [1, 12, 77, 77]> var_212_cast = reshape(shape = var_211, x = attn_weights_7_cast)[name = tensor<string, []>("op_212_cast")];
            tensor<fp16, [1, 12, 77, 77]> attn_weights_9_cast = add(x = var_212_cast, y = causal_attention_mask_to_fp16_palettized)[name = tensor<string, []>("attn_weights_9_cast")];
            tensor<int32, [3]> var_217 = const()[name = tensor<string, []>("op_217"), val = tensor<int32, [3]>([12, 77, 77])];
            tensor<fp16, [12, 77, 77]> input_21_cast = reshape(shape = var_217, x = attn_weights_9_cast)[name = tensor<string, []>("input_21_cast")];
            tensor<fp16, [12, 77, 77]> input_23_cast = softmax(axis = var_5, x = input_21_cast)[name = tensor<string, []>("input_23_cast")];
            tensor<bool, []> attn_output_7_transpose_x_0 = const()[name = tensor<string, []>("attn_output_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_7_transpose_y_0 = const()[name = tensor<string, []>("attn_output_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 77, 64]> attn_output_7_cast = matmul(transpose_x = attn_output_7_transpose_x_0, transpose_y = attn_output_7_transpose_y_0, x = input_23_cast, y = value_states_7_cast)[name = tensor<string, []>("attn_output_7_cast")];
            tensor<int32, [4]> var_222 = const()[name = tensor<string, []>("op_222"), val = tensor<int32, [4]>([1, 12, 77, 64])];
            tensor<fp16, [1, 12, 77, 64]> attn_output_9_cast = reshape(shape = var_222, x = attn_output_7_cast)[name = tensor<string, []>("attn_output_9_cast")];
            tensor<int32, [4]> attn_output_11_perm_0 = const()[name = tensor<string, []>("attn_output_11_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_225 = const()[name = tensor<string, []>("op_225"), val = tensor<int32, [3]>([1, 77, 768])];
            tensor<fp16, [1, 77, 12, 64]> transpose_50 = transpose(perm = attn_output_11_perm_0, x = attn_output_9_cast)[name = tensor<string, []>("transpose_50")];
            tensor<fp16, [1, 77, 768]> input_25_cast = reshape(shape = var_225, x = transpose_50)[name = tensor<string, []>("input_25_cast")];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(82602944))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(83045376))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(83045568)))];
            tensor<fp16, [1, 77, 768]> hidden_states_9_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16_palettized, x = input_25_cast)[name = tensor<string, []>("hidden_states_9_cast")];
            tensor<fp16, [1, 77, 768]> input_27_cast = add(x = input_19_cast, y = hidden_states_9_cast)[name = tensor<string, []>("input_27_cast")];
            tensor<int32, [1]> input_29_axes_0 = const()[name = tensor<string, []>("input_29_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(83047168)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(83048768)))];
            tensor<fp16, [1, 77, 768]> input_29_cast = layer_norm(axes = input_29_axes_0, beta = text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16, x = input_27_cast)[name = tensor<string, []>("input_29_cast")];
            tensor<fp16, [3072, 768]> text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [1769472]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(83050368))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(84819904))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([3072, 768])];
            tensor<fp16, [3072]> text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [2304]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(84820096))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(84822464))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16_palettized"), shape = tensor<uint32, [1]>([3072])];
            tensor<fp16, [1, 77, 3072]> input_31_cast = linear(bias = text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16_palettized, weight = text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16_palettized, x = input_29_cast)[name = tensor<string, []>("input_31_cast")];
            tensor<fp16, []> var_240_to_fp16 = const()[name = tensor<string, []>("op_240_to_fp16"), val = tensor<fp16, []>(0x1.b3cp+0)];
            tensor<fp16, [1, 77, 3072]> var_241_cast = mul(x = input_31_cast, y = var_240_to_fp16)[name = tensor<string, []>("op_241_cast")];
            tensor<fp16, [1, 77, 3072]> var_242_cast = sigmoid(x = var_241_cast)[name = tensor<string, []>("op_242_cast")];
            tensor<fp16, [1, 77, 3072]> input_33_cast = mul(x = input_31_cast, y = var_242_cast)[name = tensor<string, []>("input_33_cast")];
            tensor<fp16, [768, 3072]> text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [1769472]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(84822656))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(86592192))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 3072])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(86592384)))];
            tensor<fp16, [1, 77, 768]> hidden_states_11_cast = linear(bias = text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16_palettized, x = input_33_cast)[name = tensor<string, []>("hidden_states_11_cast")];
            tensor<fp16, [1, 77, 768]> input_35_cast = add(x = input_27_cast, y = hidden_states_11_cast)[name = tensor<string, []>("input_35_cast")];
            tensor<int32, [1]> hidden_states_13_axes_0 = const()[name = tensor<string, []>("hidden_states_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(86593984)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(86595584)))];
            tensor<fp16, [1, 77, 768]> hidden_states_13_cast = layer_norm(axes = hidden_states_13_axes_0, beta = text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16, x = input_35_cast)[name = tensor<string, []>("hidden_states_13_cast")];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(86597184))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87039616))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87039808)))];
            tensor<fp16, [1, 77, 768]> var_266_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16_palettized, x = hidden_states_13_cast)[name = tensor<string, []>("op_266_cast")];
            tensor<fp16, []> var_267_to_fp16 = const()[name = tensor<string, []>("op_267_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 768]> tensor_17_cast = mul(x = var_266_cast, y = var_267_to_fp16)[name = tensor<string, []>("tensor_17_cast")];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87041408))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87483840))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87484032)))];
            tensor<fp16, [1, 77, 768]> tensor_13_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16_palettized, x = hidden_states_13_cast)[name = tensor<string, []>("tensor_13_cast")];
            tensor<int32, [4]> var_272 = const()[name = tensor<string, []>("op_272"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_273_cast = reshape(shape = var_272, x = tensor_13_cast)[name = tensor<string, []>("op_273_cast")];
            tensor<int32, [4]> var_274_perm_0 = const()[name = tensor<string, []>("op_274_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87485632))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87928064))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87928256)))];
            tensor<fp16, [1, 77, 768]> tensor_15_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16_palettized, x = hidden_states_13_cast)[name = tensor<string, []>("tensor_15_cast")];
            tensor<int32, [4]> var_279 = const()[name = tensor<string, []>("op_279"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_280_cast = reshape(shape = var_279, x = tensor_15_cast)[name = tensor<string, []>("op_280_cast")];
            tensor<int32, [4]> var_281_perm_0 = const()[name = tensor<string, []>("op_281_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_288 = const()[name = tensor<string, []>("op_288"), val = tensor<int32, [4]>([1, 77, 12, 64])];
            tensor<fp16, [1, 77, 12, 64]> var_289_cast = reshape(shape = var_288, x = tensor_17_cast)[name = tensor<string, []>("op_289_cast")];
            tensor<int32, [4]> var_290_perm_0 = const()[name = tensor<string, []>("op_290_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_292 = const()[name = tensor<string, []>("op_292"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_49 = transpose(perm = var_290_perm_0, x = var_289_cast)[name = tensor<string, []>("transpose_49")];
            tensor<fp16, [12, 77, 64]> query_states_5_cast = reshape(shape = var_292, x = transpose_49)[name = tensor<string, []>("query_states_5_cast")];
            tensor<int32, [3]> var_294 = const()[name = tensor<string, []>("op_294"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_48 = transpose(perm = var_274_perm_0, x = var_273_cast)[name = tensor<string, []>("transpose_48")];
            tensor<fp16, [12, 77, 64]> key_states_11_cast = reshape(shape = var_294, x = transpose_48)[name = tensor<string, []>("key_states_11_cast")];
            tensor<int32, [3]> var_296 = const()[name = tensor<string, []>("op_296"), val = tensor<int32, [3]>([12, -1, 64])];
            tensor<fp16, [1, 12, 77, 64]> transpose_47 = transpose(perm = var_281_perm_0, x = var_280_cast)[name = tensor<string, []>("transpose_47")];
            tensor<fp16, [12, 77, 64]> value_states_11_cast = reshape(shape = var_296, x = transpose_47)[name = tensor<string, []>("value_states_11_cast")];
            tensor<int32, [3]> var_299_perm_0 = const()[name = tensor<string, []>("op_299_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_13_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_13_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 64, 77]> transpose_46 = transpose(perm = var_299_perm_0, x = key_states_11_cast)[name = tensor<string, []>("transpose_46")];
            tensor<fp16, [12, 77, 77]> attn_weights_13_cast = matmul(transpose_x = attn_weights_13_transpose_x_0, transpose_y = attn_weights_13_transpose_y_0, x = query_states_5_cast, y = transpose_46)[name = tensor<string, []>("attn_weights_13_cast")];
            tensor<int32, [4]> var_301 = const()[name = tensor<string, []>("op_301"), val = tensor<int32, [4]>([1, 12, 77, 77])];
            tensor<fp16, [1, 12, 77, 77]> var_302_cast = reshape(shape = var_301, x = attn_weights_13_cast)[name = tensor<string, []>("op_302_cast")];
            tensor<fp16, [1, 12, 77, 77]> attn_weights_15_cast = add(x = var_302_cast, y = causal_attention_mask_to_fp16_palettized)[name = tensor<string, []>("attn_weights_15_cast")];
            tensor<int32, [3]> var_307 = const()[name = tensor<string, []>("op_307"), val = tensor<int32, [3]>([12, 77, 77])];
            tensor<fp16, [12, 77, 77]> input_37_cast = reshape(shape = var_307, x = attn_weights_15_cast)[name = tensor<string, []>("input_37_cast")];
            tensor<fp16, [12, 77, 77]> input_39_cast = softmax(axis = var_5, x = input_37_cast)[name = tensor<string, []>("input_39_cast")];
            tensor<bool, []> attn_output_13_transpose_x_0 = const()[name = tensor<string, []>("attn_output_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_13_transpose_y_0 = const()[name = tensor<string, []>("attn_output_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 77, 64]> attn_output_13_cast = matmul(transpose_x = attn_output_13_transpose_x_0, transpose_y = attn_output_13_transpose_y_0, x = input_39_cast, y = value_states_11_cast)[name = tensor<string, []>("attn_output_13_cast")];
            tensor<int32, [4]> var_312 = const()[name = tensor<string, []>("op_312"), val = tensor<int32, [4]>([1, 12, 77, 64])];
            tensor<fp16, [1, 12, 77, 64]> attn_output_15_cast = reshape(shape = var_312, x = attn_output_13_cast)[name = tensor<string, []>("attn_output_15_cast")];
            tensor<int32, [4]> attn_output_17_perm_0 = const()[name = tensor<string, []>("attn_output_17_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_315 = const()[name = tensor<string, []>("op_315"), val = tensor<int32, [3]>([1, 77, 768])];
            tensor<fp16, [1, 77, 12, 64]> transpose_45 = transpose(perm = attn_output_17_perm_0, x = attn_output_15_cast)[name = tensor<string, []>("transpose_45")];
            tensor<fp16, [1, 77, 768]> input_41_cast = reshape(shape = var_315, x = transpose_45)[name = tensor<string, []>("input_41_cast")];
            tensor<fp16, [768, 768]> text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87929856))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(88372288))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(88372480)))];
            tensor<fp16, [1, 77, 768]> hidden_states_15_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16_palettized, x = input_41_cast)[name = tensor<string, []>("hidden_states_15_cast")];
            tensor<fp16, [1, 77, 768]> input_43_cast = add(x = input_35_cast, y = hidden_states_15_cast)[name = tensor<string, []>("input_43_cast")];
            tensor<int32, [1]> input_45_axes_0 = const()[name = tensor<string, []>("input_45_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(88374080)))];
            tensor<fp16, [768]> text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(88375680)))];
